RNNModel(
  (rnn_layer): LSTM(28, 128, num_layers=2, batch_first=True, dropout=0.5, bidirectional=True)
  (dropout): Dropout(p=0.5, inplace=False)
  (dense1): Linear(in_features=256, out_features=256, bias=True)
  (dense2): Linear(in_features=256, out_features=18, bias=True)
  (relu): ReLU()
)
RNNModel(
  (rnn_layer): LSTM(28, 128, batch_first=True, dropout=0.5, bidirectional=True)
  (dropout): Dropout(p=0.5, inplace=False)
  (dense1): Linear(in_features=256, out_features=256, bias=True)
  (dense2): Linear(in_features=256, out_features=18, bias=True)
  (relu): ReLU()
)
RNNModel(
  (rnn_layer): LSTM(28, 128, batch_first=True, dropout=0.5, bidirectional=True)
  (dropout): Dropout(p=0.5, inplace=False)
  (dense1): Linear(in_features=256, out_features=256, bias=True)
  (dense2): Linear(in_features=256, out_features=18, bias=True)
  (relu): ReLU()
)
RNNModel(
  (rnn_layer): LSTM(28, 128, batch_first=True, dropout=0.5, bidirectional=True)
  (dropout): Dropout(p=0.5, inplace=False)
  (dense1): Linear(in_features=256, out_features=256, bias=True)
  (dense2): Linear(in_features=256, out_features=18, bias=True)
  (relu): ReLU()
)
RNNModel(
  (rnn_layer): LSTM(28, 128, batch_first=True, dropout=0.5, bidirectional=True)
  (dropout): Dropout(p=0.5, inplace=False)
  (dense1): Linear(in_features=256, out_features=256, bias=True)
  (dense2): Linear(in_features=256, out_features=18, bias=True)
  (relu): ReLU()
)
RNNModel(
  (rnn_layer): LSTM(28, 128, batch_first=True, dropout=0.5, bidirectional=True)
  (dropout): Dropout(p=0.5, inplace=False)
  (dense1): Linear(in_features=256, out_features=256, bias=True)
  (dense2): Linear(in_features=256, out_features=18, bias=True)
  (relu): ReLU()
)
RNNModel(
  (rnn_layer): LSTM(28, 128, batch_first=True, dropout=0.5, bidirectional=True)
  (dropout): Dropout(p=0.5, inplace=False)
  (dense1): Linear(in_features=256, out_features=256, bias=True)
  (dense2): Linear(in_features=256, out_features=18, bias=True)
  (relu): ReLU()
)
